Repository: topelab/l2data2code
Catalog: src/L2Data2Code/L2Data2CodeWPF/Strings.*.resx
Languages: ca_es

source: All
ca_es: Tot

source: Area
ca_es: Àrea

# CannotGenerateCode
source: Cannot generate code while {0} is open by an IDE, close IDE to activate Generate button
ca_es: No es pot generar codi mentre {0} està obert a l'IDE, tanca l'IDE per activar el botó Generar

# CodeGeneratedOK
source: Successful code generation
ca_es: Generació de codi correcta

# ConfigChanged
source: Be careful, the settings have changed! The application will restart ... Do you want to continue?
ca_es: Compte, ha canviat la configuració! Es reiniciarà l'aplicació ... Voleu continuar?

# DeleteContents
source: Are you sure you want to delete the contents of folder {0}?
ca_es: Esteu segur d'esborrar el contingut de la carpeta {0}?

source: Edit templates
ca_es: Editar plantilles

# EmptyFolders
source: Empty folders before generating code
ca_es: Buidar carpertas abans de generar codi

# ErrorDb
source: Unable to access local database
ca_es: No es pot accedir a la BdD local

# ErrorDBSchema
source: Description server (DbSchema) not available, ask to one of these people:
ca_es: Servidor de descripcions (DbSchema) no disponible, sol·liciti amb alguna d'aquestes persones:

# ErrorDbSchemaButFile
source: Description server (DbSchema) not available, but local copy of descriptions is available
ca_es: Servidor de descripcions (DbSchema) no disponible, però hi ha disponible còpia local de descripcions

# ErrorSlnOpened
source: The solution is open and cannot be modified
ca_es: La solució està oberta i no es pot modificar

source: Generate
ca_es: Generar

# GenerateOnlyJson
source: Only genereate JSON file
ca_es: Generar només fitxer JSON

source: Message board
ca_es: Missatges

source: Module
ca_es: Mòdul

source: Name
ca_es: Nom

# NoTablesSelected
source: There are no tables selected. Do you want to continue?
ca_es: No hi ha taules selleccionadas Voleu continuar?

# NothingToDelete
source: Only elements will be added, nothing will be deleted
ca_es: Només es van a afegir elements, no es va a esborrar res

source: Open
ca_es: Obrir

source: Open generated folder
ca_es: Obrir la carpeta d'el codi generat

# OpenPSCommand
source: Open PowerShell at output directory
ca_es: Obrir PowerShell a la carpeta de sortida

# OpenSettings
source: Open app settings
ca_es: Obrir configuració de l'aplicació

source: Open vars window
ca_es: Obrir finestra de variables

# OpenVSC
source: Open output with Visual Studio Code
ca_es: Obrir sortida amb Visual Studio Code

# OpenVSSolution
source: Open solution file with Visual Studio
ca_es: Obrir la solució amb Visual Studio

source: Output folder not created
ca_es: El directori de sortida encara no està creat

source: Related Tables
ca_es: Taules relacionades

source: Save at...
ca_es: Guardar a ...

source: Selected
ca_es: Seleccionat

# SelectRelatedTables
source: Automatically select related tables
ca_es: Seleccionar automàticament les taules relacionades

source: Tables
ca_es: Taules

source: Tables & Views
ca_es: Taules i vistes

source: Template
ca_es: Plantilla

source: Value
ca_es: Valor

# Vars
source: Template Configuration
ca_es: Configuració plantilla

source: Views
ca_es: Vistes

source: Warning
ca_es: Atenció
