Repository: topelab/l2data2code
Catalog: src/L2Data2Code/L2Data2CodeUI.Shared/Localize/Messages.*.resx
Languages: ca_es, es_es

source: Added code to git
ca_es: Codi afegit a Git
es_es: Código añadido a Git

# CodeGeneratedOK
source: Successful code generation
ca_es: Codi generat correctament
es_es: Código generado correctamente

# ConfigChanged
source: Be careful, the settings have changed! The application will restart ... Do you want to continue?
ca_es: Compte, ha canviat la configuració! Es reiniciarà l'aplicació ... Voleu continuar?
es_es: ¡Cuidado, ha cambiado la configuración! Se reiniciará la aplicación... ¿Desea continuar?

# ErrorCannotRemoveFolders
source: Cannot remove folders because of template configuration
ca_es: La configuració de la plantilla no permet esborrar els directoris abans de la generació
es_es: La configuración de la plantilla no permite borrar los directorios antes de la generación

# ErrorConnectToDb
source: Cannot connect to database
ca_es: No es pot connectar a la base de dades
es_es: No se puede conectar a la base de datos

# ErrorDb
source: Database error
ca_es: Error de base de dades
es_es: Error de base de datos

# ErrorDBSchema
source: Description server (DbSchema) not available
ca_es: El servidor de descripció (DbSchema) no està disponible
es_es: El servidor de descripción (DbSchema) no está disponible

# ErrorDbSchemaButFile
source: Description server (DbSchema) not available, but local copy of descriptions is available
ca_es: El servidor de descripció (DbSchema) no està disponible, però la còpia local de les descripcions, sí
es_es: El servidor de descripción (DbSchema) no está disponible, pero la copia local de las descripciones, sí

# ErrorFindPath
source: Could not find a part of the path '{0}'
ca_es: No s'ha pogut trobar part de la ruta '{0}'
es_es: No se ha podido encontrar parte de la ruta '{0}'

source: Error generating code
ca_es: Error en generar codi
es_es: Error al generar código

# ErrorGettingTemplatePath
source: Error trying to get template path
ca_es: Error en intentar obtenir la ruta de la plantilla
es_es: Error al intentar obtener la ruta de la plantilla

# ErrorLoadingTemplate
source: Cannot load template, perhaps variables are malformed or templates names are not consistent. Open templates to find the problem
ca_es: No es pot carregar la plantilla, potser les variables tenen un format defectuós o els noms de les plantilles no són consistents. Obre plantilles per trobar el problema
es_es: No se puede cargar la plantilla, quizás las variables están mal formadas o los nombres de las plantillas no son consistentes. Abrir plantillas para encontrar el problema

# ErrorLoadingWordList
source: Cannot read word list
ca_es: No s'ha pogut llegir la llista de paraules (wordlist.txt)
es_es: No se ha podido leer la lista de palabras (wordlist.txt)

source: Error reading schema
ca_es: Error en llegir l'esquema
es_es: Error al leer el esquema

source: Error removing folders
ca_es: Error en eliminar carpetes
es_es: Error al eliminar carpetas

# ErrorResourceNotFound
source: Error resource {0} not found at path {1}
ca_es: Error recurs {0} no trobat al directori {1}
es_es: Error recurso {0} no encontrado en el dircetorio {1}

# ErrorSerializingOptions
source: Error when serializing options
ca_es: Error en serialitzar opcions
es_es: Error al serializar opciones

# ErrorSlnOpened
source: The solution is open and cannot be modified
ca_es: La solució està oberta i no es pot modificar
es_es: La solución está abierta y no se puede modificar

# ErrorWithGit
source: Git is not in this system or it has problems
ca_es: Git no està en aquest sistema o té problemes
es_es: Git no está en este sistema o tiene problemas

# NoGitRepo
source: Git repo not found
ca_es: Repositori git no trobat
es_es: Repositorio git no encontrado

# NoTablesSelected
source: There are no tables selected. Do you want to continue?
ca_es: No hi ha taules seleccionades Vols continuar?
es_es: No hay tablas seleccionadas ¿Quieres continuar?

# NothingToDelete
source: Only elements will be added, nothing will be deleted
ca_es: Només s'agregaran elements, no s'eliminarà res
es_es: Solo se agregarán elementos, no se eliminará nada

# ParametrizedContinueMessage
source: {0} will be running in background
ca_es: {0} continurà funcionant en segon pla
es_es: {0} continurá corriendo en segundo plano

# ParametrizedErrorMessage
source: {0} is not in this system or it has problems
ca_es: {0} no està en aquest sistema o té problemes
es_es: {0} no está en este sistema o tiene problemas

# ParametrizedKillingMessage
source: Killing {0} process
ca_es: Matant el procés de {0} perquè encara no ha acabat
es_es: Matando el proceso {0} porque aún no ha acabado

# ParametrizedSlowMessage
source: {0} is working hard... waiting another 10 seconds...
ca_es: {0} està treballant força... esperant altres 10 segons...
es_es: {0} está trabajando duro ... esperando otros 10 segundos ...

# ParametrizedStartingProcess
source: {0} is starting
ca_es: {0} està iniciant
es_es: {0} está iniciando

# ParametrizedStoppingProcess
source: {0} finish execution
ca_es: {0} ha acabat la execució
es_es: {0} acabó la ejecución

# TableProcessed
source: Table {0} has been precessed
ca_es: La taula {0} s'ha processat
es_es: La tabla {0} se ha procesado

# TemplateNotFound
source: Error resource template not founded at template library
ca_es: Error el recurs de plantilla no s'ha trobat a la llibreria de plantilles
es_es: Error el recurso de plantilla no se ha encontrado en la librería de plantillas

# WarnGitSlow
source: Git process is working hard... waiting another 10 seconds...
ca_es: El procés de Git està treballant força... esperant altres 10 segons ...
es_es: El proceso de Git está trabajando duro ... esperando otros 10 segundos ...

# WarnKillingGit
source: Killing Git process
ca_es: Matant el procés de Git perquè encara no ha acabat
es_es: Matando el proceso Git porque aún no ha acabado
